from datetime import datetime

import pandas as pd
import pytest
from numpy import nan
from pandas import Timestamp


@pytest.fixture
def sample_data() -> pd.DataFrame:
    """Фикстура для создания тестовых данных."""
    data = {
        "Категория": ["Еда", "Еда", "Топливо", "Развлечения", "Еда"],
        "Сумма платежа": [-150, -300, -500, -200, -100],
        "Кэшбэк": [15, 30, 50, 20, 10],
        "Статус": ["OK", "OK", "OK", "OK", "ОШИБКА"],
        "Дата операции": [
            datetime(2023, 5, 1),
            datetime(2023, 5, 15),
            datetime(2023, 5, 20),
            datetime(2023, 5, 25),
            datetime(2023, 4, 30),
        ],
    }
    return pd.DataFrame(data)


@pytest.fixture
def test_df() -> pd.DataFrame:
    return pd.DataFrame(
        {
            "Дата операции": [
                Timestamp("2021-12-31 16:44:00"),
                Timestamp("2021-11-30 16:42:04"),
                Timestamp("2021-10-20 16:39:04"),
                Timestamp("2021-10-27 15:44:39"),
                Timestamp("2021-09-30 01:23:42"),
                Timestamp("2021-09-29 05:13:42"),
            ],
            "Дата платежа": ["31.12.2021", "30.11.2021", "30.10.2021", "30.10.2021", "30.09.2021", "29.09.2021"],
            "Номер карты": ["*7197", "*7197", "*4393", "*7197", "*5091", "*5091"],
            "Статус": ["OK", "OK", "OK", "OK", "OK", "FAILED"],
            "Сумма операции": [-160.89, -64.0, -118.12, -78.05, 564.0, -100.0],
            "Валюта операции": ["RUB", "RUB", "RUB", "RUB", "RUB", "RUB"],
            "Сумма платежа": [-160.89, -64.0, -118.12, -78.05, 564.0, -100.0],
            "Валюта платежа": ["RUB", "RUB", "RUB", "RUB", "RUB", "RUB"],
            "Кэшбэк": [1.0, nan, nan, 1.0, nan, 1.0],
            "Категория": ["Супермаркеты", "Переводы", "Переводы", "Супермаркеты", "Различные товары", "Супермаркеты"],
            "MCC": [
                5411.0,
                5411.0,
                5411.0,
                5411.0,
                5399.0,
                5411.0,
            ],
            "Описание": ["Колхоз", "Колхоз", "Магнит", "Колхоз", "http://Ozon.ru", "Колхоз"],
            "Бонусы (включая кэшбэк)": [3, 1, 2, 1, 5, 4],
            "Округление на инвесткопилку": [0, 0, 0, 0, 0, 0],
            "Сумма операции с округлением": [160.89, 64.0, 118.12, 78.05, 564.0, 100.0],
        }
    )
